{
    "@odata.type":  "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id":  "4147ef04-547f-494f-8ed3-066051d110cf",
    "lastModifiedDateTime":  "2021-07-16T09:45:17.5745794Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-04-02T11:05:30.8299168Z",
    "description":  "",
    "displayName":  "Windows 10 Update | Laptops \u0026 Azure AD Join Devices | Pilot Ring",
    "version":  10,
    "deliveryOptimizationMode":  "userDefined",
    "prereleaseFeatures":  "userDefined",
    "automaticUpdateMode":  "autoInstallAndRebootAtScheduledTime",
    "microsoftUpdateServiceAllowed":  true,
    "driversExcluded":  true,
    "qualityUpdatesDeferralPeriodInDays":  3,
    "featureUpdatesDeferralPeriodInDays":  7,
    "qualityUpdatesPaused":  false,
    "featureUpdatesPaused":  false,
    "qualityUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime":  "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly":  "businessReadyOnly",
    "skipChecksBeforeRestart":  false,
    "updateWeeks":  "everyWeek",
    "qualityUpdatesPauseStartDate":  null,
    "featureUpdatesPauseStartDate":  null,
    "featureUpdatesRollbackWindowInDays":  60,
    "qualityUpdatesWillBeRolledBack":  false,
    "featureUpdatesWillBeRolledBack":  false,
    "qualityUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime":  "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays":  null,
    "engagedRestartSnoozeScheduleInDays":  null,
    "engagedRestartTransitionScheduleInDays":  null,
    "deadlineForFeatureUpdatesInDays":  null,
    "deadlineForQualityUpdatesInDays":  null,
    "deadlineGracePeriodInDays":  null,
    "postponeRebootUntilAfterDeadline":  null,
    "autoRestartNotificationDismissal":  "notConfigured",
    "scheduleRestartWarningInHours":  2,
    "scheduleImminentRestartWarningInMinutes":  15,
    "userPauseAccess":  "disabled",
    "userWindowsUpdateScanAccess":  "enabled",
    "updateNotificationLevel":  "defaultNotifications",
    "allowWindows11Upgrade":  false,
    "installationSchedule":  {
                                 "@odata.type":  "#microsoft.graph.windowsUpdateScheduledInstall",
                                 "scheduledInstallDay":  "everyday",
                                 "scheduledInstallTime":  "11:00:00.0000000"
                             },
    "groupAssignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u00274147ef04-547f-494f-8ed3-066051d110cf\u0027)/microsoft.graph.windowsUpdateForBusinessConfiguration/groupAssignments",
    "groupAssignments":  [
                             {
                                 "id":  "4147ef04-547f-494f-8ed3-066051d110cf_1cc01fb5-79b4-4083-a2a8-c0c0a52a70b5",
                                 "targetGroupId":  "1cc01fb5-79b4-4083-a2a8-c0c0a52a70b5",
                                 "excludeGroup":  false
                             },
                             {
                                 "id":  "4147ef04-547f-494f-8ed3-066051d110cf_a54857ca-c7c3-45ce-9eb5-be8a46f5eb9f",
                                 "targetGroupId":  "a54857ca-c7c3-45ce-9eb5-be8a46f5eb9f",
                                 "excludeGroup":  false
                             }
                         ]
}
