{
    "@odata.type":  "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
    "id":  "5917c5b0-a243-4ee6-9fd7-b31b40729e0b",
    "lastModifiedDateTime":  "2021-07-07T11:41:24.3062587Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-05-18T09:19:15.9784867Z",
    "description":  null,
    "displayName":  "Users - Work Profile - Device Restrictions",
    "version":  3,
    "passwordBlockFaceUnlock":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockIrisUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  180,
    "passwordMinimumLength":  6,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  10,
    "passwordRequiredType":  "atLeastNumeric",
    "workProfileAllowAppInstallsFromUnknownSources":  false,
    "workProfileDataSharingType":  "allowPersonalToWork",
    "workProfileBlockNotificationsWhileDeviceLocked":  false,
    "workProfileBlockAddingAccounts":  false,
    "workProfileBluetoothEnableContactSharing":  false,
    "workProfileBlockScreenCapture":  false,
    "workProfileBlockCrossProfileCallerId":  false,
    "workProfileBlockCamera":  false,
    "workProfileBlockCrossProfileContactsSearch":  false,
    "workProfileBlockCrossProfileCopyPaste":  true,
    "workProfileDefaultAppPermissionPolicy":  "deviceDefault",
    "workProfilePasswordBlockFaceUnlock":  false,
    "workProfilePasswordBlockFingerprintUnlock":  false,
    "workProfilePasswordBlockIrisUnlock":  false,
    "workProfilePasswordBlockTrustAgents":  false,
    "workProfilePasswordExpirationDays":  null,
    "workProfilePasswordMinimumLength":  null,
    "workProfilePasswordMinNumericCharacters":  null,
    "workProfilePasswordMinNonLetterCharacters":  null,
    "workProfilePasswordMinLetterCharacters":  null,
    "workProfilePasswordMinLowerCaseCharacters":  null,
    "workProfilePasswordMinUpperCaseCharacters":  null,
    "workProfilePasswordMinSymbolCharacters":  null,
    "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout":  null,
    "workProfilePasswordPreviousPasswordBlockCount":  null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  null,
    "workProfilePasswordRequiredType":  "deviceDefault",
    "workProfileRequirePassword":  false,
    "securityRequireVerifyApps":  false,
    "vpnAlwaysOnPackageIdentifier":  null,
    "vpnEnableAlwaysOnLockdownMode":  false,
    "workProfileAllowWidgets":  false,
    "workProfileBlockPersonalAppInstallsFromUnknownSources":  false
}
