{
    "@odata.type":  "#microsoft.graph.macOSGeneralDeviceConfiguration",
    "id":  "057bd2c7-8303-4f11-a7f5-3337be6e9816",
    "lastModifiedDateTime":  "2020-07-23T09:22:33.5317741Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2020-07-23T08:38:03.2943893Z",
    "description":  null,
    "displayName":  "macOS Config Profile",
    "version":  4,
    "compliantAppListType":  "none",
    "emailInDomainSuffixes":  [

                              ],
    "passwordBlockSimple":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordMinimumLength":  4,
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordRequiredType":  "numeric",
    "passwordRequired":  true,
    "passwordMaximumAttemptCount":  null,
    "passwordMinutesUntilFailedLoginReset":  null,
    "keychainBlockCloudSync":  false,
    "safariBlockAutofill":  false,
    "cameraBlocked":  false,
    "iTunesBlockMusicService":  false,
    "spotlightBlockInternetResults":  false,
    "keyboardBlockDictation":  false,
    "definitionLookupBlocked":  false,
    "appleWatchBlockAutoUnlock":  false,
    "iTunesBlockFileSharing":  false,
    "iCloudBlockDocumentSync":  false,
    "iCloudBlockMail":  false,
    "iCloudBlockAddressBook":  false,
    "iCloudBlockCalendar":  false,
    "iCloudBlockReminders":  false,
    "iCloudBlockBookmarks":  false,
    "iCloudBlockNotes":  false,
    "airDropBlocked":  false,
    "passwordBlockModification":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockAutoFill":  false,
    "passwordBlockProximityRequests":  false,
    "passwordBlockAirDropSharing":  false,
    "softwareUpdatesEnforcedDelayInDays":  null,
    "updateDelayPolicy":  null,
    "contentCachingBlocked":  false,
    "iCloudBlockPhotoLibrary":  false,
    "screenCaptureBlocked":  false,
    "classroomAppBlockRemoteScreenObservation":  false,
    "classroomAppForceUnpromptedScreenObservation":  false,
    "classroomForceAutomaticallyJoinClasses":  false,
    "classroomForceRequestPermissionToLeaveClasses":  false,
    "classroomForceUnpromptedAppAndDeviceLock":  false,
    "iCloudBlockActivityContinuation":  false,
    "addingGameCenterFriendsBlocked":  false,
    "gameCenterBlocked":  false,
    "multiplayerGamingBlocked":  false,
    "wallpaperModificationBlocked":  false,
    "eraseContentAndSettingsBlocked":  false,
    "softwareUpdateMajorOSDeferredInstallDelayInDays":  null,
    "softwareUpdateMinorOSDeferredInstallDelayInDays":  null,
    "softwareUpdateNonOSDeferredInstallDelayInDays":  null,
    "touchIdTimeoutInHours":  null,
    "iCloudPrivateRelayBlocked":  false,
    "iCloudDesktopAndDocumentsBlocked":  false,
    "compliantAppsList":  [

                          ],
    "privacyAccessControls":  [

                              ]
}
