{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "893f7f29-f02a-46a9-8a61-d74c0bec35c6",
    "lastModifiedDateTime":  "2021-03-20T10:15:31.2194787Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-03-20T10:15:31.2194787Z",
    "description":  null,
    "displayName":  "Enable RDP",
    "version":  1,
    "deviceManagementApplicabilityRuleOsEdition":  {
                                                       "osEditionTypes":  [
                                                                              "windows10Enterprise",
                                                                              "windows10Professional"
                                                                          ],
                                                       "name":  null,
                                                       "ruleType":  "include"
                                                   },
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingString",
                            "description":  null,
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/AllowUsersToConnectRemotely",
                            "secretReferenceValueId":  null,
                            "value":  "\u003cenabled /\u003e",
                            "isEncrypted":  false,
                            "displayName":  "RDP"
                        }
                    ]
}
