{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "e6e761a8-b516-46d9-9417-a1c2437fa16a",
    "lastModifiedDateTime":  "2021-06-14T10:40:24.4453213Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-06-14T10:40:24.4453213Z",
    "description":  null,
    "displayName":  "Screen Lock Timer in 10min",
    "version":  1,
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "ScreenLockTimer",
                            "description":  null,
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/LocalPoliciesSecurityOptions/InteractiveLogon_MachineInactivityLimit",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  600,
                            "isReadOnly":  false
                        }
                    ]
}
