{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "5a6b2f4b-ae85-42bb-8173-9d734c88ea93",
    "lastModifiedDateTime":  "2021-12-21T13:34:09.0054765Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-12-21T13:34:09.0054765Z",
    "description":  null,
    "displayName":  "Allow Removable Drives",
    "version":  1,
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "Allow Removable Drives",
                            "description":  null,
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/System/AllowStorageCard",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  1,
                            "isReadOnly":  false
                        }
                    ]
}
