{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
    "@odata.type":  "#microsoft.graph.iosStoreApp",
    "id":  "78abe32c-8292-482d-a83e-d3bcc0bd7990",
    "displayName":  "PowerPoint",
    "description":  "*** PowerPoint is ready for iPad Pro and looks amazing on the 12.9-inch screen. View PowerPoint presentations on iPad Pro for free. To create and edit presentations, you need a qualifying Office 365 subscription. Try it for free for 30 days. *** \nThe real Microsoft PowerPoint app designed for iPad, iPhone and iPod touch.\nNow PowerPoint presentations look great on your tablet and phone. When you edit or create presentations, you can be confident that they will look exactly how you want across PC, Mac, tablet and phone. PowerPoint has the familiar Office look and feel along with an intuitive touch experience, so you’ll be up and running in no time.\nOn iPhone, iPad Air, and iPad mini, the core PowerPoint experience, including viewing, creating, and editing presentations, is free. Or unlock the full PowerPoint experience with a qualifying Office 365 subscription. On iPad Pro, you need Office 365 to create and edit presentations. \n\nPOWERPOINT PRESENTATIONS LOOK AMAZING\n•Images, tables, charts, SmartArt, transitions, animations are all there, nicely formatted. \n•When presenting, see your speaker notes and use the built-in laser pointer, pens or highlighters to get your point across.\n•View email attachments and access all your PowerPoint presentations from OneDrive, Dropbox, OneDrive for Business, or SharePoint.\n\nCREATE AND EDIT WITH CONFIDENCE\n•When you edit a presentation, your content and formatting are maintained across all your devices – PC, Mac, tablet and phone.\n•Express your ideas exactly the way you want, with full support for rich formatting including fonts, pictures, tables, textboxes, shapes, transitions, animations, speaker notes and more. \n•Work simultaneously with others on the same presentation.\n•Get tasks done faster, with multitasking. Run PowerPoint for iPad side by side with other apps (requires iOS 9).\n\nCONTROL YOUR SLIDE SHOW WITH POWERPOINT REMOTE FOR APPLE WATCH\n•Project a presentation on your iPhone wirelessly on a large screen using AirPlay.\n•Start the slide show with your Apple Watch and easily navigate to the next and previous slides.  \n•At a glance, see the elapsed time, the current slide number and total number of slides. \n\nREQUIREMENTS\niPad Pro: To create or edit documents, you need a qualifying Office 365 subscription* , which also gives you access to the full Office experience.\n\niPad, iPhone, iPod Touch: To create or edit documents, sign in with a free Microsoft account. To unlock the full Office experience and to access and save documents in OneDrive for Business or on SharePoint, you need a qualifying Office 365 subscription* .\n\n*To make an in-app purchase of an Office 365 Home or Personal subscription, open the app. In the document picker screen, tap Upgrade. Subscriptions begin at from $6.99 a month in the US, and can vary by region. With an Office 365 subscription, you get access to all features in Word, Excel, and PowerPoint on iPad, iPhone, and iPod touch, and you can install Word, Excel, PowerPoint, Outlook, and OneNote on PCs or Macs.\n\nOffice 365 subscriptions purchased from the app will be charged to your iTunes account and will automatically renew within 24 hours prior to the end of the current subscription period, unless auto-renewal is disabled beforehand. To manage your subscriptions or to disable auto-renewal, after purchase, go to your iTunes account settings. A subscription cannot be cancelled during the active subscription period.\n\nPrivacy Policy: http://go.microsoft.com/fwlink/?LinkID=507539. Terms of Use: http://go.microsoft.com/fwlink/?LinkID=390698.",
    "publisher":  "Microsoft Corporation",
    "createdDateTime":  "2022-01-04T15:37:08.7191555Z",
    "lastModifiedDateTime":  "2022-01-04T15:37:08.7191555Z",
    "isFeatured":  false,
    "privacyInformationUrl":  "",
    "informationUrl":  null,
    "owner":  "",
    "developer":  "",
    "notes":  "",
    "uploadState":  1,
    "publishingState":  "published",
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "bundleId":  "com.microsoft.Office.Powerpoint",
    "appStoreUrl":  "https://itunes.apple.com/us/app/microsoft-powerpoint/id586449534?mt=8\u0026uo=4",
    "largeIcon":  {
                      "type":  "image/jpeg",
                      "value":  "/9j/4AAQSkZJRgABAQAAAQABAAD/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAA8ADwDAREAAhEBAxEB/8QAGwAAAgMBAQEAAAAAAAAAAAAAAAYCBQcEAQP/xAA4EAABAwMCBAMFAw0AAAAAAAABAgMEAAURBhIHEyExJkF0UWFxgZEUssIVFyJCUlNVcqGjscPR/8QAGwEBAAMBAQEBAAAAAAAAAAAAAAMEBQYBAgf/xAAxEQACAgECAwUHAwUAAAAAAAAAAQIDBAUREiFxBjEzQVETMmGBocHRFDSxFRZSkeH/2gAMAwEAAhEDEQA/AK3NcgfqIZoAzQBmgDNAGaAM0AZoCOaAYdMaQu2pGnHrahjktr5aluuhICsZ7dT2NWKcWy9bw7ijl6jRiNRt33fohygcH5ayDPuzDY8ww0Vn6kirsdLk/ekZVnaKC8Otvq9vyMcDhJYmQDKkTpSvMFYQk/JIz/WrEdMqXe2yhZ2hyZe4kvr/ACZ7xYs9vsOoo0S1sJjsGKlZTuKsqKlDOSSfIVn51UKrFGC25G5o2TblUOdr3e/2Qlb0/tD61SNfZnuffQ8DNAQzXp6bXwLPh24+r/AmtrTPDfU5HtD48en3Hq4X+02x7k3G5RIz2ArY66EqwexxV6V1cHtKSRj14l9y4q4Nr4IsLdOi3CMmRBksyWFdA40sKTn4ivuE4zW8XuiC2qdUuGxbP4ijqW8WaNrWJbbhBRLmyo45e9hK0pGVkZJ8uh7VVusrjaoyW7ZpYmPfPFlbXLaMXz5v4HFoC/af1ZzWF2KDEnto5ha5KFJWntlJ2jsSMg+2o8W6rI5cCTJ9SxMnB2krXKL893+TJNettsa0vLTDaG2kSCEoQkAAYHYCsrKSV0kvU6bTZOeLW5Pd7FBmq5eI5oDauBZ8PXH1n+tNbWm+G+pyXaHx49Puzi1hKs0TioHdRtoct/5PSClbZcG7rjoPnUd8q45O9vdsTYNd89O4cZ7S4vXYtOCkV1CL5MaZdYtcmQDEQ50yAVdR8ikZ93uqXTotcUktot8itr003XBveaXP6f8ARb4xzZFr4jW24R0pDjMNCkKcTlBO9fQ+3v2qDUJOF0ZLyRe0OuN2HOqXc2/4QzcHoL0lqRd5lot8JOA3FWxG5Slj9Y9+qew+RqfAg2nZKKXpy2KOuWxg1RCxy83u9+nzMu4iHx1fPUn7orNy/Gl1Oh0v9pX0F3NVi+QzXp6bXwLPh24+s/AmtjTfDfU5LtB48en3Ywr09Jd4jJvjgjrgCF9nKVHKt/8ALjGKsexbv9p5bbFFZkVg/p1vxcW/yHFHQDHYVbRlsQtbXhcDU6WReIUFBioXy5FvckkncrqCnoKpZFnDPbiS5em5sYGOraG/ZuXPyko+nqfTS+pJE++Rozmo4MxC92WGrW6ypeEk9FqOB2z8qU3uU1HjT+TR5l4Ua6XNVOPxck/ojHuIx8d331J+6KycvxpdTqNK/Z19BczVc0COaA1bg9qG02q0TY1yuDEV9yTvQl0lIKdgGc9u4rUwLoQi4ye3M5vW8S662M64tpLy6msQZ8OaAqHLjyAf3TqV/wCDWnGUZdz3ObnVOv3011R3JJHfI+NfZCzM+I+ubhpXVLTUCLEeS5EQsl7dkHcoeR91UMrKlRZsl5G7pmmQzaG5NrZ/gW/zzX7+G2z+5/2q/wDU5+iL39uU/wCb+ggXu5O3i7y7jJQ2h6S4XFJbztBwB0z8KoWzdk3N+Zu41Cx6o1R7kcWajJiOa9AZoDwABW5P6KvaOh+tFy7g0pcmW0HUl+t+PsN6uDIHZPOKk/RWRU0Mi2HdJlO3T8a33oL/AEfK93u5X2S3JvEkSJCGw0F7EpO0EkZwAPM1822ytfFIkxcWvFi4VrZN7lfmoywGaAM0B5XgCgCgCgCgCgCgCgP/2Q=="
                  },
    "applicableDeviceType":  {
                                 "iPad":  true,
                                 "iPhoneAndIPod":  true
                             },
    "minimumSupportedOperatingSystem":  {
                                            "v8_0":  true,
                                            "v9_0":  false,
                                            "v10_0":  false,
                                            "v11_0":  false,
                                            "v12_0":  false,
                                            "v13_0":  false,
                                            "v14_0":  false
                                        }
}
