{
    "@odata.type":  "#microsoft.graph.androidWorkProfileCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "9ccda4b1-1d2a-4c98-b87d-2236dda47477",
    "createdDateTime":  "2021-05-18T09:14:41.4120888Z",
    "description":  null,
    "lastModifiedDateTime":  "2021-06-03T09:51:43.0051247Z",
    "displayName":  "Users - Work Profile - Compliance Policy",
    "version":  3,
    "passwordRequired":  true,
    "passwordMinimumLength":  6,
    "passwordRequiredType":  "numeric",
    "passwordMinutesOfInactivityBeforeLock":  1,
    "passwordExpirationDays":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "securityPreventInstallAppsFromUnknownSources":  true,
    "securityDisableUsbDebugging":  false,
    "securityRequireVerifyApps":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityBlockJailbrokenDevices":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "storageRequireEncryption":  true,
    "securityRequireSafetyNetAttestationBasicIntegrity":  false,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "securityRequireGooglePlayServices":  false,
    "securityRequireUpToDateSecurityProviders":  false,
    "securityRequireCompanyPortalAppIntegrity":  false,
    "securityRequiredAndroidSafetyNetEvaluationType":  "basic"
}
